app/controllers/api/greetings_controller.rb

SELECT "greetings".* FROM "greetings"
---
    def index
      @greeting = Greeting.all.sample